app/controllers/pins_controller.rb

INSERT INTO "pins" ("description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "This pin should have a user"], ["user_id", 5], ["created_at", "2017-01-09 06:35:41.970866"], ["updated_at", "2017-01-09 06:35:41.970866"]]
---
  def create
    @pin = current_user.pins.build(pin_params)
      if @pin.save

SELECT  "pins".* FROM "pins" WHERE "pins"."id" = ? LIMIT 1  [["id", 4]]
---
    def set_pin
      @pin = Pin.find_by(id: params[:id])